# Лабораторная работа №3: структуры, объединения, перечисления

## Информация о студенте
**Фамилия, имя:** Бебутов Худайберди
**Курс:** 1  
**Группа:** ИВТ-1

---

## Задача 2.2 – Побайтовая распечатка unsigned long через union 

### Постановка задачи
Напишите программу, которая использует union для побайтовой распечатки типа unsigned long.

### Математическая модель
Тип unsigned long занимает в памяти несколько байт (обычно 4 или 8 в зависимости от платформы).  
Объединение позволяет интерпретировать одни и те же байты памяти как разные типы данных.  
В данной задаче те же самые байты, которые хранят значение unsigned long, интерпретируются как массив unsigned char.

### Список идентификаторов

| Имя переменной | Тип данных | Смысловое обозначение |
|----------------|------------|------------------------|
| data           | unsigned long | исходное целое число без знака |
| i              | int        | счётчик цикла |
| bytes_union    | union { unsigned long val; unsigned char byte[sizeof(unsigned long)]; } | объединение для побайтового доступа |

### Код программы 

```c
#include <stdio.h>

int main() {
    unsigned long data;
    union {
        unsigned long val;
        unsigned char byte[sizeof(unsigned long)];
    } bytes_union;
    
    scanf("%lu", &data);
    
    bytes_union.val = data;
    
    for (int i = 0; i < sizeof(unsigned long); i++) {
        printf("%u ", bytes_union.byte[i]);
    }
    printf("\n");
    
    return 0;
}
