# Лабораторная работа №3: структуры, объединения, перечисления

## Информация о студенте
**Фамилия, имя:** Бебутов Худайберди 
**Курс:** 1  
**Группа:** ИВТ-1

---

## Задача 2.1 – Указатель на объединение 

### Постановка задачи
Напишите программу, которая использует указатель на некоторое объединение union.

### Математическая модель
Объединение позволяет хранить разные типы данных в одной области памяти.  
Через указатель на объединение можно обращаться к любому из полей.

### Список идентификаторов

| Имя переменной | Тип данных | Смысловое обозначение |
|----------------|------------|------------------------|
| data           | union Data | объединение для хранения int, float, char[20] |
| ptr            | union Data* | указатель на объединение |
| choice         | int        | выбор типа для вывода |

### Код программы 

```c
#include <stdio.h>

union Data {
    int i;
    float f;
    char str[20];
};

int main() {
    union Data data;
    union Data *ptr = &data;
    int choice;

    ptr->i = 42;
    printf("int: %d\n", ptr->i);

    ptr->f = 3.14159;
    printf("float: %f\n", ptr->f);

    sprintf(ptr->str, "Hello, Union!");
    printf("string: %s\n", ptr->str);

    printf("\nВыберите тип для вывода (1=int, 2=float, 3=string): ");
    scanf("%d", &choice);

    if (choice == 1)
        printf("int: %d\n", ptr->i);
    else if (choice == 2)
        printf("float: %f\n", ptr->f);
    else if (choice == 3)
        printf("string: %s\n", ptr->str);
    else
        printf("Неверный выбор\n");

    return 0;
}
